app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_hash", "email", "first_name", "last_name", "image_url") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["username", ""], ["password_hash", "$2a$10$loBlo.9banZpwLghEK6.uuVU6O4Y1NuaPtaXXIE9tNAl6M6F6z6oa"], ["email", "mike@gmail.com"], ["first_name", ""], ["last_name", ""], ["image_url", ""]]
---
  def create
    @user = User.new(user_params)

    if @user.save